Revit 2026 API

# ViewIsolateElementsTemporary Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void IsolateElementsTemporary(
	ICollection<ElementId> elementIds
)
```
```vb
Public Sub IsolateElementsTemporary (
	elementIds As ICollection(Of ElementId)
)
```
```cpp
public:
void IsolateElementsTemporary(
	ICollection<ElementId^>^ elementIds
)
```
```fsharp
member IsolateElementsTemporary :
        elementIds : ICollection<ElementId> -> unit
```

#### Parameters

elementIds ICollectionElementId

#### Reference

View Class

Autodesk.Revit.DB Namespace